* Example Rest API calls

#+NAME: org_project
#+BEGIN_SRC restclient :pretty
GET https://gitlab.com/api/v4/projects/paytonrules%2Forg
Authorization: Bearer fFsGsR7Mf6TfCoks2-_r
#+END_SRC

#+RESULTS: org_project
#+BEGIN_SRC js
{
  "id": 3723174,
  "description": "My Org mode share",
  "name": "org",
  "name_with_namespace": "Eric Smith / org",
  "path": "org",
  "path_with_namespace": "paytonrules/org",
  "created_at": "2017-07-17T15:56:42.096Z",
  "default_branch": "master",
  "tag_list": [],
  "ssh_url_to_repo": "git@gitlab.com:paytonrules/org.git",
  "http_url_to_repo": "https://gitlab.com/paytonrules/org.git",
  "web_url": "https://gitlab.com/paytonrules/org",
  "readme_url": "https://gitlab.com/paytonrules/org/-/blob/master/README.md",
  "avatar_url": null,
  "forks_count": 0,
  "star_count": 0,
  "last_activity_at": "2020-10-12T22:20:08.593Z",
  "namespace": {
    "id": 1784043,
    "name": "Eric Smith",
    "path": "paytonrules",
    "kind": "user",
    "full_path": "paytonrules",
    "parent_id": null,
    "avatar_url": "https://secure.gravatar.com/avatar/803fcca23f9005c09887b33dddcd0cd8?s=80&d=identicon",
    "web_url": "https://gitlab.com/paytonrules"
  },
  "_links": {
    "self": "https://gitlab.com/api/v4/projects/3723174",
    "issues": "https://gitlab.com/api/v4/projects/3723174/issues",
    "merge_requests": "https://gitlab.com/api/v4/projects/3723174/merge_requests",
    "repo_branches": "https://gitlab.com/api/v4/projects/3723174/repository/branches",
    "labels": "https://gitlab.com/api/v4/projects/3723174/labels",
    "events": "https://gitlab.com/api/v4/projects/3723174/events",
    "members": "https://gitlab.com/api/v4/projects/3723174/members"
  },
  "packages_enabled": null,
  "empty_repo": false,
  "archived": false,
  "visibility": "private",
  "owner": {
    "id": 1470946,
    "name": "Eric Smith",
    "username": "paytonrules",
    "state": "active",
    "avatar_url": "https://secure.gravatar.com/avatar/803fcca23f9005c09887b33dddcd0cd8?s=80&d=identicon",
    "web_url": "https://gitlab.com/paytonrules"
  },
  "resolve_outdated_diff_discussions": null,
  "container_registry_enabled": true,
  "issues_enabled": true,
  "merge_requests_enabled": true,
  "wiki_enabled": true,
  "jobs_enabled": true,
  "snippets_enabled": true,
  "service_desk_enabled": true,
  "service_desk_address": "incoming+paytonrules-org-3723174-issue-@incoming.gitlab.com",
  "can_create_merge_request_in": true,
  "issues_access_level": "enabled",
  "repository_access_level": "enabled",
  "merge_requests_access_level": "enabled",
  "forking_access_level": "enabled",
  "wiki_access_level": "enabled",
  "builds_access_level": "enabled",
  "snippets_access_level": "enabled",
  "pages_access_level": "public",
  "emails_disabled": null,
  "shared_runners_enabled": true,
  "lfs_enabled": true,
  "creator_id": 1470946,
  "import_status": "none",
  "import_error": null,
  "open_issues_count": 0,
  "runners_token": "K9tmM4kSmjrdX2p7gs1b",
  "ci_default_git_depth": null,
  "public_jobs": true,
  "build_git_strategy": "fetch",
  "build_timeout": 3600,
  "auto_cancel_pending_pipelines": "enabled",
  "build_coverage_regex": null,
  "ci_config_path": null,
  "shared_with_groups": [],
  "only_allow_merge_if_pipeline_succeeds": false,
  "allow_merge_on_skipped_pipeline": null,
  "request_access_enabled": false,
  "only_allow_merge_if_all_discussions_are_resolved": false,
  "remove_source_branch_after_merge": null,
  "printing_merge_request_link_enabled": true,
  "merge_method": "merge",
  "suggestion_commit_message": null,
  "auto_devops_enabled": false,
  "auto_devops_deploy_strategy": "continuous",
  "autoclose_referenced_issues": true,
  "external_authorization_classification_label": "",
  "compliance_frameworks": [],
  "permissions": {
    "project_access": {
      "access_level": 40,
      "notification_level": 3
    },
    "group_access": null
  }
}
// GET https://gitlab.com/api/v4/projects/paytonrules%2Forg
// HTTP/1.1 200 OK
// Date: Tue, 13 Oct 2020 12:12:26 GMT
// Content-Type: application/json
// Transfer-Encoding: chunked
// Connection: keep-alive
// Vary: Accept-Encoding
// Cache-Control: max-age=0, private, must-revalidate
// Etag: W/"d2928f678b3dd36d179ea2b746e4b68c"
// Vary: Origin
// X-Content-Type-Options: nosniff
// X-Frame-Options: SAMEORIGIN
// X-Request-Id: 8cRuOLT5Ve7
// X-Runtime: 0.084983
// Strict-Transport-Security: max-age=31536000
// Referrer-Policy: strict-origin-when-cross-origin
// RateLimit-Limit: 600
// RateLimit-Observed: 2
// RateLimit-Remaining: 598
// RateLimit-Reset: 1602591206
// RateLimit-ResetTime: Tue, 13 Oct 2020 12:13:26 GMT
// GitLab-LB: fe-05-lb-gprd
// GitLab-SV: localhost
// CF-Cache-Status: DYNAMIC
// cf-request-id: 05c3795aaf000058a4d4aa8200000001
// Expect-CT: max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
// Server: cloudflare
// CF-RAY: 5e18f80ab87758a4-ORD
// Request duration: 0.169003s
#+END_SRC

#+NAME: files
#+BEGIN_SRC restclient :pretty
GET https://gitlab.com/api/v4/projects/3723174/repository/files/gtd%2Finbox%2Eorg?ref=master
Authorization: Bearer fFsGsR7Mf6TfCoks2-_r
#+END_SRC

#+RESULTS: files
#+BEGIN_SRC js
{
  "file_name": "inbox.org",
  "file_path": "gtd/inbox.org",
  "size": 34,
  "encoding": "base64",
  "content_sha256": "9b81be1adafc88e6280362923da02f5911e29513cda2d68bfc79a41c60b1da76",
  "ref": "master",
  "blob_id": "7ac4e91bd7163f91db4f4a4c3ca50e57cf8d97d7",
  "commit_id": "1b0ac22d92738aa263ee3a79a41207eef52be7f7",
  "last_commit_id": "a114488783123712c769503a770d6fb06d22be16",
  "content": "IytUSVRMRTogVGhlIEluYm94IGR1bXBpbmcgZ3JvdW5kCg=="
}
// GET https://gitlab.com/api/v4/projects/3723174/repository/files/gtd%2Finbox%2Eorg?ref=master
// HTTP/1.1 200 OK
// Date: Tue, 13 Oct 2020 12:18:54 GMT
// Content-Type: application/json
// Transfer-Encoding: chunked
// Connection: keep-alive
// Vary: Accept-Encoding
// Cache-Control: max-age=0, private, must-revalidate
// Etag: W/"988bca7a6c30a69a5cbc1aa809829e6e"
// Vary: Origin
// X-Content-Type-Options: nosniff
// X-Frame-Options: SAMEORIGIN
// X-Gitlab-Blob-Id: 7ac4e91bd7163f91db4f4a4c3ca50e57cf8d97d7
// X-Gitlab-Commit-Id: 1b0ac22d92738aa263ee3a79a41207eef52be7f7
// X-Gitlab-Content-Sha256: 9b81be1adafc88e6280362923da02f5911e29513cda2d68bfc79a41c60b1da76
// X-Gitlab-Encoding: base64
// X-Gitlab-File-Name: inbox.org
// X-Gitlab-File-Path: gtd/inbox.org
// X-Gitlab-Last-Commit-Id: a114488783123712c769503a770d6fb06d22be16
// X-Gitlab-Ref: master
// X-Gitlab-Size: 34
// X-Request-Id: wR8HTlJi9J2
// X-Runtime: 0.083763
// Strict-Transport-Security: max-age=31536000
// Referrer-Policy: strict-origin-when-cross-origin
// RateLimit-Limit: 600
// RateLimit-Observed: 1
// RateLimit-Remaining: 599
// RateLimit-Reset: 1602591594
// RateLimit-ResetTime: Tue, 13 Oct 2020 12:19:54 GMT
// GitLab-LB: fe-07-lb-gprd
// GitLab-SV: localhost
// CF-Cache-Status: DYNAMIC
// cf-request-id: 05c37f43a3000058a4d4a24200000001
// Expect-CT: max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
// Server: cloudflare
// CF-RAY: 5e19017f6d4d58a4-ORD
// Request duration: 0.181817s
#+END_SRC
IytUSVRMRTogVGhlIEluYm94IGR1bXBpbmcgZ3JvdW5kCg==

#+BEGIN_SRC ruby
require "base64"

inbox = Base64.decode64("IytUSVRMRTogVGhlIEluYm94IGR1bXBpbmcgZ3JvdW5kCg==")
"#{inbox}\n- new item"
#+END_SRC

#+RESULTS:
: #+TITLE: The Inbox dumping ground
:
: - new item


#+NAME: put_file
#+BEGIN_SRC restclient :pretty
PUT https://gitlab.com/api/v4/projects/3723174/repository/files/gtd%2Finbox%2Eorg?ref=master
Authorization: Bearer fFsGsR7Mf6TfCoks2-_r
Content-Type: application/json

{
    "branch": "master",
    "author_email": "paytonrules@gmail.com",
    "author_name": "Eric Smith",
    "content": "replacement content",
    "commit_message": "hello gitlab"
}
#+END_SRC

#+RESULTS: put_file
#+BEGIN_SRC js
{
  "file_path": "gtd/inbox.org",
  "branch": "master"
}
// PUT https://gitlab.com/api/v4/projects/3723174/repository/files/gtd%2Finbox%2Eorg?ref=master
// HTTP/1.1 200 OK
// Date: Tue, 13 Oct 2020 12:41:46 GMT
// Content-Type: application/json
// Content-Length: 47
// Connection: keep-alive
// Cache-Control: max-age=0, private, must-revalidate
// Etag: W/"d943c4307819aa5d5c0caf325ba319e8"
// Vary: Origin
// X-Content-Type-Options: nosniff
// X-Frame-Options: SAMEORIGIN
// X-Request-Id: KPwBi8k1Wn9
// X-Runtime: 0.4replacement content09612
// Strict-Transport-Security: max-age=31536000
// Referrer-Policy: strict-origin-when-cross-origin
// RateLimit-Limit: 600
// RateLimit-Observed: 2
// RateLimit-Remaining: 598
// RateLimit-Reset: 1602592966
// RateLimit-ResetTime: Tue, 13 Oct 2020 12:42:46 GMT
// GitLab-LB: fe-07-lb-gprd
// GitLab-SV: localhost
// CF-Cache-Status: DYNAMIC
// cf-request-id: 05c39434200000c50cec0b9200000001
// Expect-CT: max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
// Server: cloudflare
// CF-RAY: 5e1923003de0c50c-ORD
// Request duration: 0.510438s
#+END_SRC
